Revit 2026 API

# BoundingBoxXYZEnabled Property

---

Defines whether the entire bounding box is enabled.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Enabled { get; set; }
```
```vb
Public Property Enabled As Boolean
	Get
	Set
```
```cpp
public:
property bool Enabled {
	bool get ();
	void set (bool value);
}
```
```fsharp
member Enabled : bool with get, set
```

#### Property Value

Boolean

A disabled bounding box might be used to signal that the corresponding Revit functionality is deactivated. For example, a disabled 3D view section box represents an inactive section box.

#### Reference

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace